app/models/user.rb

    def reset_session_token!
        self.update!(session_token: SecureRandom.base64(16))
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "WK30x1Kc0D+73NbDzQs/1g=="], ["updated_at", "2020-03-03 23:04:09.716124"], ["id", 3]]